
qrqk_option = (
    ('', '溯源情况--全部'),
    (1, '溯源'),
    (0, '非溯源'),
)
# 治理情况
zzqk_option = (
        ('', '整治情况--全部'),
        ('已治理', '已治理'),
        ('正在治理', '正在治理'),
        ('计划治理', '计划治理'),
)

# 乡镇的列表
XZ_CHOICE = (
    ('', '乡镇--全部'),
    ('114122002', '北企公司'),
    ('1141132', '百善镇'),
    ('1141150', '北七家镇'),
    ('1140010', '城北街道'),
    ('1140050', '城南街道'),
    ('1141120', '崔村镇'),
    ('1141250', '东小口地区'),
    ('1141240', '回龙观地区'),
    ('114125013', '霍营街道'),
    ('1141180', '流村镇'),
    ('1141220', '马池口地区'),
    ('1141210', '南口地区'),
    ('1141110', '南邵镇'),
    ('1141230', '沙河地区'),
    ('1141190', '十三陵镇'),
    ('114125027', '天通苑北街道'),
    ('1141100', '小汤山镇'),
    ('1141160', '兴寿镇'),
    ('1141260', '延寿镇'),
    ('1141040', '阳坊镇'),
)

# 河流的列表
hl_choice=[
    ("","排入河流--全部"),
]

# 排水情况
ps_choice=(
    ("","排水情况--全部"),
    ("有排水","有排水"),
    ("无排水","无排水"),
)

# 排水性质选项
psxz_option = (
    ('', '排水性质--全部'),
    ('01', '工业'),
    ('02', '混合'),
    ('03', '生活'),
    ('04', '雨水'),
    ('05', '养殖'),
)

# 是否的选择项
YesNo_option=(
    ("是","是"),
    ("否","否")
)

# 有无得选择项
yw_option=(
    ("有","有"),
    ("无","无")
)
# 左右的选择项
LeftRight_option=(
    ("左","左"),
    ("右","右")
)

# 所有的河流名称
hlAll_choice=[
    ('东沙河','东沙河'),
    ('南庄河','南庄河'),
    ('西峪沟','西峪沟'),
    ('肖村河','肖村河'),
    ('大辛峰排水渠','大辛峰排水渠'),
    ('四排干','四排干'),
    ('七燕干渠','七燕干渠'),
    ('东小口沟','东小口沟'),
    ('天通河','天通河'),
    ('天通一河','天通一河'),
    ('五排干','五排干'),
    ('二排干','二排干'),
    ('南沙河','南沙河'),
    ('七排干','七排干'),
    ('十一排干','十一排干'),
    ('碧水河','碧水河'),
    ('朱辛东河','朱辛东河'),
    ('十三排干','十三排干'),
    ('高崖口沟','高崖口沟'),
    ('柏峪沟','柏峪沟'),
    ('狼儿峪东沟','狼儿峪东沟'),
    ('漆园沟','漆园沟'),
    ('温榆河','温榆河'),
    ('北沙河','北沙河'),
    ('七白河','七白河'),
    ('中直渠','中直渠'),
    ('幸福河','幸福河'),
    ('东沙屯西排水','东沙屯西排水'),
    ('白浪河','白浪河'),
    ('葫芦河','葫芦河'),
    ('蔺沟','蔺沟'),
    ('牤牛河','牤牛河'),
    ('孟祖河','孟祖河'),
    ('秦屯河','秦屯河'),
    ('唐自头村东排沟','唐自头村东排沟'),
    ('桃林排水','桃林排水'),
    ('沙沟河（蔺沟）','沙沟河（蔺沟）'),
    ('二干排水','二干排水'),
    ('一干排水','一干排水'),
    ('东庄排水','东庄排水'),
    ('小沙河','小沙河'),
    ('桃峪口沟（秦屯河）','桃峪口沟（秦屯河）'),
    ('桃峪口沟支流','桃峪口沟支流'),
    ('钻子岭沟(蔺沟)','钻子岭沟(蔺沟)'),
    ('钻子岭沟支流','钻子岭沟支流'),
    ('黑山寨沟','黑山寨沟'),
    ('黑山寨沟支流','黑山寨沟支流'),
    ('慈悲峪沟','慈悲峪沟'),
    ('叉河','叉河'),
    ('东贯市东路边沟','东贯市东路边沟'),
    ('京密引水渠','京密引水渠'),
    ('前章村西侧排沟','前章村西侧排沟'),
    ('前章村西路边沟','前章村西路边沟'),
    ('沙阳路边沟','沙阳路边沟'),
    ('史家桥村沟','史家桥村沟'),
    ('四家庄村沟','四家庄村沟'),
    ('四家庄河','四家庄河'),
    ('温阳路边沟','温阳路边沟'),
    ('阳东路边沟','阳东路边沟'),
    ('百善西排水','百善西排水'),
    ('牛房圈西排水','牛房圈西排水'),
    ('八排干','八排干'),
    ('八仙南排干','八仙南排干'),
    ('曹碾南排干','曹碾南排干'),
    ('梁家沟','梁家沟'),
    ('六排干','六排干'),
    ('六排干支','六排干支'),
    ('鲁疃沟','鲁疃沟'),
    ('鲁疃西沟','鲁疃西沟'),
    ('南七家老河湾','南七家老河湾'),
    ('清河','清河'),
    ('三排干','三排干'),
    ('关沟河','关沟河'),
    ('关沟','关沟'),
    ('南口西河','南口西河'),
    ('兴隆口沟','兴隆口沟'),
    ('辛店一道河','辛店一道河'),
    ('辛店河','辛店河'),
    ('舒畅河','舒畅河'),
    ('幸福河支渠','幸福河支渠'),
    ('北小营西河','北小营西河'),
    ('王家元水库下游','王家元水库下游'),
    ('邓庄河','邓庄河'),
    ('锥石口沟','锥石口沟'),
    ('上下口沟','上下口沟'),
    ('德胜口沟','德胜口沟'),
]
# 排放规律
pfgl_choice=(
    ("间歇","间歇"),
    ("连续",'连续'),
)

# 排污口形状
pwkxz_choice=(
    ("涵闸","涵闸"),
    ("管道","管道"),
    ("明渠（沟）","明渠（沟）"),
    ("方涵","方涵"),
)

# 治理方式类别
zlfs_option=(
    ("雨水","雨水"),
    ("退水口","退水口"),
    ("入河口","入河口"),
    ("供水泄水口","供水泄水口"),
    ("封堵","封堵"),
    ("截污纳管","截污纳管"),
    ("拆迁清除","拆迁清除"),
    ("废弃","废弃"),
    ("经污水处理设施排放","经污水处理设施排放"),
    ("集中收集抽运","集中收集抽运")
)
